cases/chpt4-tin-solid-506-func/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    cold
    {
//        type            noSlip;
        type            fixedValue;
        value           uniform (0 0 0);
    }
    btm
    {
//        type            noSlip;
        type            fixedValue;
        value           uniform (0 0 0);
    }
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }        
    hot
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type empty;
    }
    hotTop
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    coldTop
    {
        $cold;
    }
}


// ************************************************************************* //
